app/controllers/authentication/sessions_controller.rb

  def create
    @user = User.find_by("email = :login OR username = :login", { login: params[:login] })
---
SELECT "users".* FROM "users" WHERE (email = 'pepe@vendelo.com' OR username = 'pepe@vendelo.com') LIMIT $1  [["LIMIT", 1]]