app/controllers/authentication/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "daniel_eslonh@outlook.com"], ["username", "danielEs"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-18 01:49:50.002416"], ["updated_at", "2023-04-18 01:49:50.002416"]]