app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1038477725], ["LIMIT", 1]]
---
  def set_current_user
    Current.user = User.find_by(id: session[:user_id]) if session[:user_id]