app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test 1"], ["created_at", "2023-04-14 16:03:23.352234"], ["updated_at", "2023-04-14 16:03:23.352234"]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test"], ["created_at", "2023-04-14 16:00:48.168362"], ["updated_at", "2023-04-14 16:00:48.168362"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save
      redirect_to categories_url, notice: t('.created')

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 7]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 5]]
---
  def destroy
    category.destroy

    redirect_to categories_url, notice: t('.destroyed')

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def category
      @category = Category.find(params[:id])