app/controllers/favorites_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 803818265], ["LIMIT", 1]]
---
  def product
    @product ||= Product.find(params[:product_id])