app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (price >= '190') AND (price <= '230') ORDER BY "products"."created_at" DESC

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["description", "test"], ["price", 50], ["created_at", "2023-04-14 19:35:36.321641"], ["updated_at", "2023-04-14 19:35:36.321641"], ["category_id", 630261496]]

  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "Funciona regular"], ["updated_at", "2023-04-14 17:49:39.657239"], ["id", 1]]