app/controllers/products_controller.rb

  def index
    @categories = Category.order(name: :asc).load_async
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC

  def product
    @product ||= Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1012971773], ["LIMIT", 1]]