app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "paco01"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by!(username: params[:username])