app/controllers/concerns/authentication.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 280205884], ["LIMIT", 1]]
---
    def set_current_user
    Current.user = User.find_by(id: session[:user_id]) if session[:user_id]