app/views/products/_form.html.erb

  <div>
    <%= form.collection_select :category_id, Category.all.order(name: :asc), :id, :name, { prompt: t(".category_placeholder") }, { class: "rounded-2xl border-gray-200 mb-4 w-full text-gray-500"} %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC