app/views/products/index.html.erb


    <%= form.select :order_by, options_for_select(Product::ORDER_BY.keys.map { |order| [t(".#{order}"), order] }, params[:order_by]), {}, { onChange: 'this.form.requestSubmit()' } %>
---
SELECT "products".* FROM "products" WHERE (price >= '190') AND (price <= '230') ORDER BY "products"."created_at" DESC


  <%= turbo_frame_tag "products-#{@pagy.page}", class: 'products' do %>
---
SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC